Revit 2026 API
RebarConstraint.GetPositiveOffsetDirectionForToOtherRebarConstraint Method
 Returns the positive offset direction vector.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public XYZ GetPositiveOffsetDirectionForToOtherRebarConstraint()
Public Function GetPositiveOffsetDirectionForToOtherRebarConstraint As XYZ
public:
XYZ^ GetPositiveOffsetDirectionForToOtherRebarConstraint()
member GetPositiveOffsetDirectionForToOtherRebarConstraint : unit -> XYZ
Return Value
XYZ
 The positive offset direction vector.
Exceptions
Exception | Condition
InvalidOperationException |  RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'. -or- The TargetRebarConstraintType is not valid.
Remarks
 This is available only for constraints of type ToOtherRebar.
 Valid TargetRebarConstraintType are:
RebarPlane
Edge
OutOfPlaneExtent
StartOfBar, only if the RebarShape has a definition of RebarShapeMultiplanarDefinition with [!:RebarShapeMultiplanarDefinition::IsStartConnectorPressent]
EndOfBar, only if the RebarShape has a definition of RebarShapeMultiplanarDefinition with [!:RebarShapeMultiplanarDefinition::IsEndConnectorPressent]
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace